Repository: riyanari/bumilku
Catalog: lib/l10n/app_*.arb
Languages: id

# selfDetectionDesc
source: Detect your pregnancy condition now
id: Mari deteksi kondisi kehamilan Anda sekarang

# checkHistory
source: Checkup History
id: Riwayat Pemeriksaan

# checkHistoryDesc
source: This history is generated from self detection
id: Riwayat pemeriksaan ini adalah riwayat yang dihasilkan dari self detection

# maternalNursingTitle
source: What is Maternal Nursing?
id: Apa itu Keperawatan Maternitas?

# maternalNursingDesc
source: Maternal nursing focuses on maternal health
id: Keperawatan maternitas adalah cabang keperawatan yang fokus pada kesehatan

# faqTitle
source: Frequently Asked Questions
id: Pertanyaan Umum

# faqDesc
source: Read common questions often asked during pregnancy
id: Mari baca pertanyaan yang sering kali ditanyakan saat hamil

# noPregnancyData
source: No pregnancy data yet
id: Belum ada data kehamilan

source: Add Pregnancy
id: Tambah Kehamilan

source: Try Again
id: Coba Lagi

# medicalDataNotAvailable
source: Medical data is not available
id: Data medis belum tersedia

source: Add First Pregnancy
id: Tambah Kehamilan Pertama

# logoutConfirmTitle
source: Logout Confirmation
id: Konfirmasi Logout

# logoutConfirmDesc
source: Are you sure you want to log out from BUMILKU?
id: Apakah Anda yakin ingin logout dari aplikasi BUMILKU?

source: Cancel
id: Batal

# addPregnancyNewTitle
source: Add New Pregnancy
id: Tambah Kehamilan Baru

# addPregnancyNewDesc
source: Do you want to add new pregnancy data?
id: Apakah Anda ingin menambah data kehamilan baru?

source: Add
id: Tambah

# pregnancyCalendarTitle
source: Pregnancy Calendar
id: Kalender Kehamilan

# lastPeriodLabel
source: Last period (LMP)
id: Haid pertama terakhir

# dueDateLabel
source: Estimated due date
id: Prediksi melahirkan

# setPeriodInfoTitle
source: Menstrual Information
id: Atur Informasi Haid

# setPeriodInfoDesc
source: Last Menstrual Period (LMP) is the first day of your last period. This information is used to calculate gestational age and estimate your due date.
id: Hari Pertama Haid Terakhir (LMP) adalah hari pertama menstruasi terakhir Anda. Data ini digunakan untuk menghitung usia kehamilan dan memperkirakan Hari Perkiraan Lahir (HPL).

# lmpDateLabel
source: LMP Date
id: Tanggal Hari Pertama Haid Terakhir

# cycleLengthLabel
source: Cycle Length
id: Panjang Siklus Menstruasi

# daysUnit
source: days
id: hari

source: Save
id: Simpan

# pregnancyWeekInfo
source: You are entering week {weeks} of pregnancy
id: Anda memasuki minggu ke-{weeks} usia kehamilan

# selfDetectionTitle
source: Self Pregnancy Check
id: Deteksi Mandiri Ibu Hamil

source: Detection History
id: Riwayat Deteksi

source: Back
id: Kembali

source: Next
id: Lanjut

source: Calculate Risk
id: Hitung Risiko

# completeStepData
source: Please complete the data on this step.
id: Harap lengkapi data pada langkah ini.

# signUpNewAccountTitle
source: Create New Account
id: Daftar Akun Baru

# emailRequired
source: Email is required
id: Email wajib diisi

# emailInvalid
source: Invalid email format
id: Format email tidak valid

# confirmPasswordHint
source: Confirm Password
id: Konfirmasi Password

# passwordRequired
source: Password is required
id: Password wajib diisi

# passwordMin6
source: Password must be at least 6 characters
id: Password minimal 6 karakter

# confirmPasswordRequired
source: Confirm password is required
id: Konfirmasi password wajib diisi

# passwordNotMatch
source: Passwords do not match
id: Password tidak cocok

# passwordStrengthLabel
source: Password strength:
id: Kekuatan Password:

# passwordStrengthWeak
source: Weak
id: Lemah

# passwordStrengthFair
source: Fair
id: Cukup

# passwordStrengthGood
source: Good
id: Baik

# passwordStrengthStrong
source: Strong
id: Kuat

source: Show password
id: Tampilkan password

source: Hide password
id: Sembunyikan password

# signUpButton
source: Sign up
id: Daftar

# signingUpLoading
source: Signing up...
id: Mendaftarkan...

# signupWelcomeTitle
source: Welcome! 👋
id: Selamat datang! 👋

# signupWelcomeDesc
source: Before we start, let’s get to know you first
id: Sebelum mulai, mari berkenalan terlebih dahulu

# signupNameLabel
source: Your Name
id: Nama Bunda

# signupNameHint
source: Enter your name
id: Masukkan nama Bunda

# signupNameEmpty
source: Name cannot be empty
id: Nama tidak boleh kosong

# signupNameMin2
source: Name must be at least 2 characters
id: Nama minimal 2 karakter

# signupNameMax30
source: Name must be at most 30 characters
id: Nama maksimal 30 karakter

# signupAddressLabel
source: Address
id: Alamat

# signupAddressHint
source: Enter your full address
id: Masukkan alamat lengkap

# signupAddressEmpty
source: Address cannot be empty
id: Alamat tidak boleh kosong

# signupDobLabel
source: Date of Birth
id: Tanggal Lahir

# signupDobHint
source: Select date of birth
id: Pilih tanggal lahir

# signupDobRequired
source: Date of birth is required
id: Tanggal lahir wajib diisi

# vitalTitle
source: Vital Signs
id: Data Vital

# vitalSystolicLabel
source: Systolic (mmHg)
id: Sistolik (mmHg)

# vitalDiastolicLabel
source: Diastolic (mmHg)
id: Diastolik (mmHg)

# vitalTempLabel
source: Body temperature (°C)
id: Suhu tubuh (°C)

# vitalPulseLabel
source: Pulse (beats/min)
id: Nadi (x/menit)

# vitalRespLabel
source: Respiratory rate (breaths/min)
id: Frekuensi napas (x/menit)

# vitalSystolicRequired
source: Systolic is required
id: Sistolik harus diisi

# vitalDiastolicRequired
source: Diastolic is required
id: Diastolik harus diisi

# vitalTempRequired
source: Temperature is required
id: Suhu tubuh harus diisi

# vitalPulseRequired
source: Pulse is required
id: Nadi harus diisi

# vitalRespRequired
source: Respiratory rate is required
id: Frekuensi napas harus diisi

# vitalValidNumber
source: Please enter a valid number
id: Masukkan angka yang valid

# vitalNormalTitle
source: Normal Values:
id: Nilai Normal:

# vitalNormalBpMain
source: • Blood pressure: 90/60 - 139/89 mmHg
id: • Tekanan darah: 90/60 - 139/89 mmHg

# vitalNormalBpSys
source: - Systolic (upper): 90-139 mmHg
id: - Sistolik (atas): 90-139 mmHg

# vitalNormalBpDia
source: - Diastolic (lower): 60-89 mmHg
id: - Diastolik (bawah): 60-89 mmHg

# vitalNormalTemp
source: • Body temperature: 36 - 37.5°C
id: • Suhu tubuh: 36 - 37.5°C

# vitalNormalPulse
source: • Pulse: 60 - 100 beats/min
id: • Nadi: 60 - 100 x/menit

# vitalNormalResp
source: • Respiratory rate: 16 - 20 breaths/min
id: • Frekuensi napas: 16 - 20 x/menit

# complaintsTitle
source: Reported Complaints
id: Keluhan yang Dirasakan

# complaintsLegendTitle
source: Legend:
id: Keterangan:

# complaintsLegendHigh
source: High-risk complaint
id: Keluhan berisiko tinggi

# complaintsLegendMedium
source: Needs attention
id: Keluhan perlu perhatian

# complaintsLegendNormal
source: Normal complaint
id: Keluhan normal

# complaintsPickInstruction
source: Select the complaints you are experiencing:
id: Pilih keluhan yang dialami saat ini:

# complaintsSelectedCount
source: {count} complaint(s) selected
id: {count} keluhan dipilih

# fetalMoveTitle
source: Fetal Movement Tracking
id: Pencatatan Gerakan Janin

# fetalMoveImportantInfoTitle
source: Important Information
id: Informasi Penting

# fetalMoveImportantInfoDesc
source: Fetal movement tracking is performed for {hours} hours. Normal fetal movement: at least 10 movements within {hours} hours. Record all movements you feel during this {hours}-hour period.
id: Pencatatan gerakan janin dilakukan selama {hours} jam. Gerakan janin normal: minimal 10 gerakan dalam {hours} jam. Catat semua gerakan yang dirasakan dalam periode {hours} jam.

# fetalMoveMainParams
source: Main Tracking Parameters
id: Parameter Utama Pencatatan

# fetalMoveMotherSubjective
source: Mother’s Subjective Condition
id: Kondisi Subjektif Ibu

# fetalMoveStartDateTimeLabel
source: Start Date & Time
id: Tanggal & Waktu Mulai Pencatatan

# fetalMovePickDateTime
source: Select date & time
id: Pilih tanggal & waktu

# fetalMoveCountLabel
source: Total Movements in {hours} Hours
id: Jumlah Gerakan dalam {hours} Jam

# fetalMoveCountHint
source: Enter total movements in {hours} hours
id: Masukkan total gerakan dalam {hours} jam

# fetalMoveTimesSuffix
source: times
id: kali

# fetalMoveTargetHint
source: Target: at least 10 movements in 12 hours
id: Target: minimal 10 gerakan dalam 12 jam

# fetalMoveDurationInfo
source: Tracking Duration: {hours} Hours
id: Durasi Pencatatan: {hours} Jam

# fetalMoveActivityPatternLabel
source: Fetal Activity Pattern
id: Pola Aktivitas Janin

# fetalMoveComparisonLabel
source: Compared to the Previous Day
id: Perbandingan Gerakan dengan Hari Sebelumnya

# fetalMoveOtherComplaintsLabel
source: Other Complaints
id: Keluhan Lain yang Dirasakan

# fetalPatternMorning
source: More active in the morning
id: Lebih aktif pagi hari

# fetalPatternAfternoon
source: More active in the afternoon
id: Lebih aktif siang hari

# fetalPatternNight
source: More active at night
id: Lebih aktif malam hari

# fetalPatternNoPattern
source: No specific pattern
id: Tidak ada pola khusus

# fetalCompareMoreActive
source: More active
id: Lebih aktif

# fetalCompareSame
source: About the same
id: Sama saja

# fetalCompareLess
source: Less active
id: Lebih sedikit

# fetalComplaintDizzyWeak
source: Dizzy/weak
id: Pusing/lemas

# fetalComplaintAbdominalPain
source: Abdominal pain
id: Nyeri perut

# fetalComplaintNone
source: None
id: Tidak ada

# fetalMoveErrorRequired
source: Movement count is required
id: Jumlah gerakan harus diisi

# fetalMoveErrorInvalidNumber
source: Enter a valid number
id: Masukkan angka yang valid

# fetalMoveErrorNegative
source: Cannot be negative
id: Tidak boleh negatif

# fetalMoveSummaryEmpty
source: Enter movement count to see the summary
id: Isi jumlah gerakan untuk melihat ringkasan

# fetalMoveSummaryMoves
source: Movements: {count} in {hours} hours ({perHour} movements/hour)
id: Gerakan: {count} kali dalam {hours} jam ({perHour} gerakan/jam)

# fetalMoveSummaryDetailTitle
source: Tracking Details:
id: Detail Pencatatan:

# fetalMoveSummaryDetailCount
source: • Total movements: {count}
id: • Jumlah gerakan: {count} kali

# fetalMoveSummaryDetailDuration
source: • Duration: {hours} hours
id: • Durasi: {hours} jam

# fetalMoveSummaryDetailTarget
source: • Minimum target: 10 movements
id: • Target minimal: 10 gerakan

# fetalMoveSummaryDetailPattern
source: • Pattern: {pattern}
id: • Pola: {pattern}

# fetalMoveSummaryDetailCompare
source: • Comparison: {compare}
id: • Perbandingan: {compare}

# fetalMoveSummaryDetailComplaints
source: • Complaints: {complaints}
id: • Keluhan: {complaints}

# fetalStatusIncomplete
source: Incomplete Data
id: Data Belum Lengkap

# fetalStatusNormal
source: Normal
id: Kondisi Normal

# fetalStatusMonitoring
source: Needs Monitoring
id: Perlu Pemantauan

# fetalStatusAttention
source: Needs Attention
id: Perlu Perhatian

# fetalStatusEmergency
source: Urgent Attention
id: Perhatian Khusus

# fetalMsgNormal
source: Fetal movement is within the normal range ({count} movements in {hours} hours).
id: Gerakan janin dalam batas normal ({count} gerakan dalam {hours} jam).

# fetalMsgMonitoring
source: Fetal movement is {count} in {hours} hours. Keep monitoring regularly and watch for changes.
id: Gerakan janin {count} kali dalam {hours} jam. Tetap pantau secara rutin dan perhatikan perubahan gerakan.

# fetalMsgAttention
source: Fetal movement is {count} in {hours} hours. Consider consulting a healthcare professional.
id: Gerakan janin {count} kali dalam {hours} jam. Disarankan konsultasi dengan tenaga kesehatan.

# fetalMsgEmergency
source: Fetal movement is only {count} in {hours} hours. Contact a healthcare professional immediately.
id: Gerakan janin hanya {count} kali dalam {hours} jam. Segera hubungi tenaga kesehatan.

# fetalMsgIncomplete
source: Complete the tracking data for an accurate analysis.
id: Lengkapi data pencatatan untuk analisis yang akurat.

# complaintNauseaVomiting
source: Nausea and vomiting
id: Mual dan muntah

# complaintBloating
source: Bloating
id: Kembung

# complaintHeartburn
source: Heartburn
id: Maag / nyeri ulu hati

# complaintHeadache
source: Headache
id: Sakit kepala

# complaintFetalMovement
source: Fetal movement
id: Gerakan Janin

# complaintAbdominalCramp
source: Abdominal cramps
id: Kram perut

# complaintVaginalDischarge
source: Vaginal discharge
id: Keputihan

# complaintCravings
source: Cravings
id: Ngidam

# complaintBleedingSpotting
source: Bleeding / spotting
id: Pendarahan / bercak dari jalan lahir

# complaintSwelling
source: Swelling (hands/feet/face)
id: Bengkak pada kaki / tangan / wajah

# complaintConstipation
source: Constipation
id: Sembelit

# complaintExcessiveFatigue
source: Excessive fatigue
id: Kelelahan berlebihan

# complaintSleepyDizzy
source: Dizziness / sleepiness
id: Ngantuk dan pusing

# complaintMoodChanges
source: Mood changes
id: Perubahan mood

# complaintSleepProblems
source: Sleep problems
id: Masalah tidur

# complaintLossOfAppetite
source: Loss of appetite
id: Hilang nafsu makan

# complaintFastHeartbeat
source: Fast heartbeat
id: Detak jantung cepat

# complaintBackPain
source: Back pain
id: Nyeri pinggang / punggung

# complaintShortnessOfBreath
source: Shortness of breath
id: Sesak napas

# complaintBlurredVision
source: Blurred vision
id: Pandangan kabur / berkunang-kunang

# complaintEarlyContractions
source: Early contractions
id: Kontraksi dini (perut sering kencang sebelum waktunya)

# pregnancyHistoryTitle
source: Pregnancy & Delivery History
id: Riwayat Kehamilan & Persalinan

# pregnancyHistorySubtitle
source: Fill in based on your previous pregnancy and delivery history
id: Isilah sesuai dengan riwayat kehamilan dan persalinan sebelumnya

# pregnancyHistoryChildrenCountLabel
source: Number of children already born
id: Jumlah anak yang sudah lahir

# pregnancyHistoryFirstPregnancyAgeLabel
source: Your age at first pregnancy
id: Usia bunda saat pertama kali hamil

# pregnancyHistoryPregnancyGapLabel
source: Gap from the previous pregnancy
id: Jarak kehamilan dengan anak sebelumnya

# pregnancyHistoryObstetricHistoryLabel
source: Obstetric history (miscarriage, C-section, preterm birth, ectopic pregnancy, etc.)
id: Riwayat Obstetrik atau riwayat kehamilan dan persalinan (riwayat keguguran, riwayat caesar, riwayat kelahiran prematur, riwayat hamil ektopik atau di luar kandungan, dll)

# pregnancyHistoryDeliveryComplicationsLabel
source: Delivery complications history (bleeding, high blood pressure during pregnancy, etc.)
id: Riwayat komplikasi persalinan (perdarahan, tekanan darah tinggi saat hamil, dll.)

# pregnancyHistoryBabyWeightHistoryLabel
source: Baby birth history (normal weight ≥2.5 kg / large >4 kg)
id: Riwayat bayi lahir (berat badan normal >=2.5 / besar >4 kg)

# pregnancyHistoryPreviousPregnancyLabel
source: Previous pregnancy outcome (normal/complicated/stillbirth)
id: Riwayat kehamilan sebelumnya (normal/bermasalah/janin meninggal)

# pregnancyHistoryExamplesTitle
source: Example:
id: Contoh pengisian:

# pregnancyHistoryExampleObstetricLabel
source: • Obstetric / previous pregnancy & delivery history
id: • Riwayat obstetrik / kehamilan & persalinan sebelumnya

# pregnancyHistoryExampleComplicationLabel
source: • Delivery complications history
id: • Riwayat komplikasi persalinan

# pregnancyHistoryExampleObstetricValue
source: • Obstetric history: 1 miscarriage, 1 C-section
id: • Riwayat obstetri: Pernah keguguran 1x, SC 1x

# pregnancyHistoryExampleComplicationValue
source: • Complications: Postpartum hemorrhage
id: • Komplikasi: Perdarahan pasca persalinan

# pregnancyHistoryExampleBabyWeightValue
source: • Baby birth: Normal weight at least 2.5 kg
id: • Bayi lahir: Berat badan normal minimal 2.5 kg

# validationRequiredChildrenCount
source: Number of children is required
id: Jumlah anak harus diisi

# validationRequiredFirstPregnancyAge
source: Age at first pregnancy is required
id: Usia pertama hamil harus diisi

# validationInvalidNumber
source: Please enter a valid number
id: Masukkan angka yang valid

# unitYears
source: years
id: tahun

# unitMonths
source: months
id: bulan

# healthHistoryTitle
source: Mother’s Health History
id: Riwayat Kesehatan Bunda

# healthHistorySubtitle
source: This information helps healthcare providers understand your condition
id: Informasi ini membantu tenaga kesehatan memahami kondisi Anda

# healthHistoryDiseaseLabel
source: Past/current illnesses (high blood pressure, diabetes, heart disease, etc.)
id: Penyakit yang pernah/sedang diderita (tekanan darah tinggi, diabetes, jantung, dll.)

# healthHistoryAllergyLabel
source: Allergy history (medications/foods/other substances)
id: Riwayat alergi (obat/makanan/bahan tertentu)

# healthHistorySurgeryLabel
source: Surgery history (excluding C-section)
id: Riwayat operasi (selain SC)

# healthHistoryMedicationLabel
source: Regular medications (including vitamins/herbal supplements)
id: Konsumsi obat-obatan rutin (termasuk vitamin/herbal)

# healthHistoryExamplesTitle
source: Example:
id: Contoh pengisian:

# healthHistoryExampleDisease
source: • Illness: high blood pressure since 2020
id: • Penyakit: tekanan darah tinggi sejak 2020

# healthHistoryExampleAllergy
source: • Allergy: Amoxicillin antibiotic allergy
id: • Alergi: Alergi antibiotik Amoxicillin

# healthHistoryExampleSurgery
source: • Surgery: appendectomy in 2018
id: • Operasi: Usus buntu tahun 2018

# healthHistoryExampleMedication
source: • Medications: regular blood pressure meds, prenatal vitamins
id: • Obat: Obat tekanan darah tinggi rutin, vitamin prenatal

# commonInvalidNumber
source: Enter a valid number
id: Masukkan angka yang valid

# physicalDataTitle
source: Mother’s Physical Data
id: Data Fisik Bunda

# physicalDataSubtitle
source: This data is used to calculate Body Mass Index (BMI)
id: Data ini digunakan untuk menghitung Indeks Massa Tubuh (IMT)

# physicalDataHeightLabel
source: Height (cm)
id: Tinggi badan (cm)

# physicalDataWeightBeforeLabel
source: Pre-pregnancy weight (kg)
id: Berat badan sebelum hamil (kg)

# physicalDataCurrentWeightLabel
source: Current weight (kg)
id: Berat badan saat ini (kg)

# physicalDataMuacLabel
source: Mid-upper arm circumference (MUAC) (cm)
id: Lingkar lengan atas (LILA) (cm)

# physicalDataHeightRequired
source: Height is required
id: Tinggi badan harus diisi

# physicalDataWeightBeforeRequired
source: Pre-pregnancy weight is required
id: Berat sebelum hamil harus diisi

# physicalDataCurrentWeightRequired
source: Current weight is required
id: Berat saat ini harus diisi

# physicalDataBmiValue
source: Body Mass Index (BMI): {value}
id: Indeks Massa Tubuh (IMT): {value}

# physicalDataBmiCategoryUnderweight
source: Category: Underweight
id: Kategori: Kurus

# physicalDataBmiCategoryNormal
source: Category: Normal
id: Kategori: Normal

# physicalDataBmiCategoryOverweight
source: Category: Overweight
id: Kategori: Kelebihan berat

# physicalDataBmiCategoryObesity
source: Category: Obesity
id: Kategori: Obesitas

# physicalDataNormalValuesTitle
source: Normal values:
id: Nilai Normal:

# physicalDataNormalBmi
source: • Normal BMI: 18.5 - 24.9
id: • IMT normal: 18.5 - 24.9

# physicalDataNormalMuac
source: • Normal MUAC: ≥ 23.5 cm
id: • LILA normal: ≥ 23.5 cm

# physicalDataBmiUnderweightInfo
source: • BMI < 18.5: Underweight
id: • IMT < 18.5: Kurus

# physicalDataBmiOverweightInfo
source: • BMI ≥ 25: Overweight
id: • IMT ≥ 25: Kelebihan berat

# physicalDataBmiObesityInfo
source: • BMI ≥ 30: Obesity
id: • IMT ≥ 30: Obesitas

# commonPickDate
source: Select a date
id: Pilih tanggal

# menstrualTitle
source: Menstrual & Pregnancy Data
id: Data Haid & Kehamilan

# menstrualSubtitle
source: This information helps determine gestational age
id: Informasi ini membantu menentukan usia kehamilan

# menstrualLmpLabel
source: First Day of Last Menstrual Period (LMP)*
id: Tanggal Hari Pertama Haid Terakhir (HPHT)*

# menstrualLmpRequired
source: Last menstrual period date is required
id: Tanggal haid terakhir harus diisi

# menstrualCycleLabel
source: Menstrual cycle (regular/irregular, how many days)
id: Siklus haid (teratur/tidak, berapa hari)

# menstrualFetalMovementLabel
source: Fetal movement (felt/not yet/reduced)
id: Gerakan janin (sudah terasa/belum/berkurang)

# menstrualUltrasoundLabel
source: Ultrasound result (if available)
id: Hasil pemeriksaan USG (jika sudah ada)

# menstrualPregnancyInfoTitle
source: Pregnancy Information:
id: Informasi Kehamilan:

# menstrualEddLine
source: • Estimated Due Date (EDD): {date}
id: • Perkiraan Hari Lahir (HPL): {date}

# menstrualGestationalAgeLine
source: • Gestational age: {weeks} weeks
id: • Usia kehamilan: {weeks} minggu

# menstrualImportantInfoTitle
source: Important Information:
id: Informasi Penting:

# menstrualImportantBullet1
source: • LMP is used to estimate gestational age
id: • HPHT digunakan untuk menghitung usia kehamilan

# menstrualImportantBullet2
source: • Fetal movement is usually felt starting around weeks 18–20
id: • Gerakan janin biasanya terasa mulai minggu 18-20

# menstrualImportantBullet3
source: • Ultrasound helps confirm gestational age and fetal development
id: • USG membantu memastikan usia kehamilan dan perkembangan janin

# lifestyleTitle
source: Social & Lifestyle Factors
id: Faktor Sosial & Gaya Hidup

# lifestyleSubtitle
source: This information helps identify lifestyle-related risk factors
id: Informasi ini membantu memahami faktor risiko dari gaya hidup

# lifestyleAgeLabel
source: Your current age (years)
id: Usia bunda sekarang (tahun)

# lifestyleSmokingTitle
source: Smoking status / secondhand smoke exposure
id: Status merokok / paparan asap rokok

# lifestyleAlcoholDrugTitle
source: Alcohol / illegal drug use
id: Konsumsi alkohol / obat-obatan terlarang

# lifestylePhysicalActivityLabel
source: Daily physical activity (active/light/mostly resting)
id: Aktivitas fisik harian (aktif/ringan/banyak istirahat)

# lifestyleFamilySupportLabel
source: Family support (good/limited/none)
id: Dukungan keluarga (ada/minim/tidak ada)

# lifestyleRiskInfoTitle
source: Key Risk Factors:
id: Faktor Risiko Penting:

# lifestyleRiskBullet1
source: • Age <20 or >35 increases risk
id: • Usia <20 atau >35 tahun meningkatkan risiko

# lifestyleRiskBullet2
source: • Smoking/secondhand smoke can harm the baby
id: • Merokok/paparan asap rokok berisiko untuk janin

# lifestyleRiskBullet3
source: • Alcohol/illegal drugs are very dangerous in pregnancy
id: • Alkohol/obat terlarang sangat berbahaya untuk kehamilan

# lifestyleRiskBullet4
source: • Family support is important for mental health
id: • Dukungan keluarga penting untuk kesehatan mental

# lifestyleSmokingNone
source: Non-smoker
id: Tidak merokok

# lifestyleSmokingActive
source: Smoker
id: Merokok

# lifestyleSmokingPassive
source: Exposed to secondhand smoke
id: Terpapar asap rokok

# lifestyleAlcoholNone
source: None
id: Tidak mengonsumsi

# lifestyleAlcoholYes
source: Uses alcohol
id: Mengonsumsi alkohol

# lifestyleDrugsYes
source: Uses illegal drugs
id: Mengonsumsi obat terlarang

# errorAgeRequired
source: Current age is required
id: Usia saat ini harus diisi

# errorInvalidNumber
source: Please enter a valid number
id: Masukkan angka yang valid

# selfDetectionLoading
source: Calculating risk...
id: Sedang menghitung risiko...

# selfDetectionResultTitle
source: Self-Detection Result
id: Hasil Deteksi Mandiri

# saveResultTooltip
source: Save Result
id: Simpan Hasil

# totalRiskPointsLabel
source: Total Risk Points:
id: Total Poin Risiko:

source: No specific recommendation
id: Tidak ada rekomendasi spesifik

# riskHigh
source: High Risk
id: Risiko Tinggi

# riskAttention
source: Needs Attention
id: Perlu Perhatian

# riskMonitoring
source: Needs Monitoring
id: Perlu Pemantauan

source: Unknown
id: Tidak Diketahui

# identifiedRiskFactorsTitle
source: Identified Risk Factors
id: Faktor Risiko yang Teridentifikasi
