Repository: riyanari/bumilku
Catalog: lib/l10n/app_*.arb
Languages: id

# complaintEducationTitle
source: Complaint Education
id: Edukasi Keluhan

# riskEducationTitle
source: Risk Education
id: Edukasi Risiko

# healthyPregnancyTipsTitle
source: Healthy Pregnancy Tips
id: Tips Kehamilan Sehat

# recommendationTitle
source: Recommendation
id: Rekomendasi

# fetalMovementRecordTitle
source: Fetal Movement Recording Result
id: Hasil Pencatatan Gerakan Janin

# recordDetailTitle
source: Recording Details:
id: Detail Pencatatan:

# movementCountLabel
source: Movement Count
id: Jumlah Gerakan

# recordDurationLabel
source: Recording Duration
id: Durasi Pencatatan

# movementsPerHourLabel
source: Movements / Hour
id: Gerakan per Jam

# comparisonWithYesterdayLabel
source: Compared to Yesterday
id: Perbandingan dengan Kemarin

# activityPatternLabel
source: Activity Pattern
id: Pola Aktivitas

source: No data
id: Tidak ada data

# timesSuffix
source: times
id: kali

# hoursSuffix
source: hours
id: jam

# movementsPerHourSuffix
source: moves/hour
id: gerakan/jam

# fetalMovementNormalStandard
source: Normal standard: at least 10 movements in 12 hours ({value} moves/hour)
id: Standar normal: minimal 10 gerakan dalam 12 jam ({value} gerakan/jam)

# fetalMovementIncompleteTitle
source: Incomplete Data
id: Data Belum Lengkap

# fetalMovementNormalTitle
source: Normal
id: Kondisi Normal

# fetalMovementMonitoringTitle
source: Needs Monitoring
id: Perlu Pemantauan

# fetalMovementAttentionTitle
source: Needs Attention
id: Perlu Perhatian

# fetalMovementCriticalTitle
source: Critical
id: Perhatian Khusus

# fetalMovementIncompleteMsg
source: Fetal movement data is incomplete. Please complete the recording.
id: Data gerakan janin belum lengkap. Silakan lengkapi pencatatan.

# fetalMovementNormalMsg
source: Fetal movements are within normal limits ({count} movements in 12 hours).
id: Gerakan janin dalam batas normal ({count} gerakan dalam 12 jam).

# fetalMovementMonitoringMsg
source: Fetal movements are {count} in 12 hours. Monitor regularly and watch for changes.
id: Gerakan janin {count} kali dalam 12 jam. Tetap pantau secara rutin dan perhatikan perubahan gerakan.

# fetalMovementAttentionMsg
source: Fetal movements are {count} in 12 hours. Consultation with a healthcare provider is recommended.
id: Gerakan janin {count} kali dalam 12 jam. Disarankan konsultasi dengan tenaga kesehatan.

# fetalMovementCriticalMsg
source: Fetal movements are only {count} in 12 hours. Contact a healthcare provider immediately.
id: Gerakan janin hanya {count} kali dalam 12 jam. Segera hubungi tenaga kesehatan.

# saveDetectionResultButton
source: Save Detection Result
id: Simpan Hasil Deteksi

# backToSelfDetectionButton
source: Back to Self-Detection
id: Kembali ke Deteksi Mandiri

# saveResultDialogTitle
source: Save Result
id: Simpan Hasil Deteksi

# saveResultDialogMessage
source: Do you want to save this result? It will be stored in your detection history.
id: Apakah Anda ingin menyimpan hasil deteksi ini? Hasil akan disimpan dalam riwayat deteksi.

# saveSuccessSnack
source: Result saved successfully!
id: Hasil deteksi berhasil disimpan!

# riskMsgHigh
source: Fetal movements are very low. Contact a healthcare provider immediately.
id: Gerakan janin sangat berkurang. Segera hubungi tenaga kesehatan.

# riskMsgAttention
source: Fetal movements are reduced. Consultation with a healthcare provider is recommended.
id: Gerakan janin berkurang. Disarankan konsultasi dengan tenaga kesehatan.

# riskMsgMonitoring
source: Fetal movements are close to the minimum. Monitor regularly and watch for changes.
id: Gerakan janin mendekati batas minimal. Pantau rutin dan perhatikan perubahan.

# riskMsgNormal
source: Fetal movements are within normal limits. Continue regular monitoring.
id: Gerakan janin dalam batas normal. Lanjutkan pemantauan rutin.

# riskMsgUnknown
source: Data is incomplete or invalid.
id: Data belum lengkap atau tidak valid.

# historyTitle
source: Detection History
id: Riwayat Deteksi

# historySectionTitle
source: Self-Detection History
id: Riwayat Deteksi Mandiri

# historyErrorTitle
source: Something went wrong
id: Terjadi kesalahan

# historyRetry
source: Try Again
id: Coba Lagi

# historyEmptyTitle
source: No detection history yet
id: Belum ada riwayat deteksi

# historyEmptySubtitle
source: Your self-detection results will appear here
id: Hasil deteksi mandiri akan muncul di sini

# historyStartDetectionNow
source: Start Self Detection Now
id: Lakukan Self Detection Sekarang

# historyUserDataUnavailable
source: Data is not available
id: Data tidak tersedia

# historyPleaseRelogin
source: Please sign in again
id: Silakan login ulang

# historyFetalMovementLabel
source: Fetal Movements
id: Gerakan Janin

# historyDetailLabel
source: Details
id: Detail

# historyAgeYears
source: {age} years old
id: {age} tahun

# historyDetailCount
source: {count} factors
id: {count} faktor

# riskLevelHigh
source: High Risk
id: Risiko Tinggi

# riskLevelNeedAttention
source: Needs Attention
id: Perlu Perhatian

# riskLevelNeedMonitoring
source: Needs Monitoring
id: Perlu Pemantauan

# riskLevelUnknown
source: Unknown
id: Tidak Diketahui

# riskStatusNeedsTreatment
source: Needs Treatment
id: Perlu Penanganan

# riskStatusNeedsAttention
source: Needs Attention
id: Perlu Perhatian

# riskStatusNeedsMonitoring
source: Needs Monitoring
id: Perlu Pemantauan

# riskStatusSafe
source: Safe
id: Aman

# riskStatusUnknown
source: Unknown
id: Tidak Diketahui

# mothersListTitle
source: Mothers List
id: Daftar Bunda

# searchNameOrUsernameHint
source: Search name or username...
id: Cari nama atau username...

# noMotherData
source: No mother data yet
id: Belum ada data bunda

# notFoundTitle
source: Not found
id: Tidak ditemukan

source: No results for '{query}'
id: Tidak ada hasil untuk '{query}'

# badgeMother
source: Mother
id: Bunda

# yearsOldShort
source: years
id: tahun

# languageTooltip
source: Language
id: Bahasa

source: Logout failed
id: Logout gagal

# tabDevelopment
source: Development
id: Perkembangan

source: {age} years
id: {age} tahun

source: Loading pregnancy data...
id: Memuat data kehamilan...

source: Loading detection history...
id: Memuat riwayat deteksi...

# loadingDataGeneric
source: Loading data...
id: Memuat data...

# noPregnancyDataTitle
source: No Pregnancy Data
id: Belum Ada Data Kehamilan

# noPregnancyDataSubtitle
source: Pregnancy data will appear here
id: Data kehamilan akan muncul di sini

# pregnancyNumber
source: Pregnancy {n}
id: Kehamilan {n}

source: Active Pregnancy
id: Kehamilan Aktif

source: Pregnancy History
id: Riwayat Kehamilan

# activeLabel
source: Active
id: Aktif

# babyNameLabel
source: 👶 Baby Name
id: 👶 Nama Bayi

# babyNameNotSet
source: Not set
id: Belum diberi nama

# lmpLabel
source: 📅 LMP
id: 📅 HPHT

# eddLabel
source: 🎯 Due Date
id: 🎯 Perkiraan Lahir

# cycleLabel
source: 🔄 Cycle
id: 🔄 Siklus

# cycleDaysValue
source: {n} days
id: {n} hari

# pregnancyProgressTitle
source: Pregnancy Progress
id: Perkembangan Kehamilan

# gestationalAgeLabel
source: Gestational Age
id: Usia Kandungan

# gestationalAgeValue
source: {weeks} weeks {days} days
id: {weeks} minggu {days} hari

# daysToBirthLabel
source: Days to Due Date
id: Hari Menuju Lahir

# daysValue
source: {n} days
id: {n} hari

# timelineTitle
source: Development Timeline
id: Timeline Perkembangan

# weekRange1_13
source: Weeks 1-13
id: Minggu 1-13

# weekRange14_27
source: Weeks 14-27
id: Minggu 14-27

# weekRange28_40
source: Weeks 28-40
id: Minggu 28-40

# dataCreatedAt
source: Created at: {date}
id: Data dibuat: {date}

# fetalMovementMonitoringHeader
source: Fetal Movement Monitoring
id: Pemantauan Gerakan Janin

# selfDetectionHistoryHeader
source: Self Detection History
id: Riwayat Self Detection

# fetalMovementHistoryHeader
source: Fetal Movement History
id: Riwayat Gerakan Janin

# noSelfDetectionDataTitle
source: No Self Detection Data
id: Belum Ada Data Self Detection

# noSelfDetectionDataSubtitle
source: Self detection records will appear here
id: Data deteksi mandiri akan muncul di sini

# noFetalMovementDataTitle
source: No Fetal Movement Data
id: Belum Ada Data Gerakan Janin

# noFetalMovementDataSubtitle
source: Fetal movement records will appear here
id: Data gerakan janin akan muncul di sini

# fetalMovementStatsTitle
source: Fetal Movement Statistics
id: Statistik Gerakan Janin

# avgMovementsLabel
source: Average Movements
id: Rata-rata Gerakan

# normalSessionsLabel
source: Normal Sessions
id: Sesi Normal

# totalSessionsLabel
source: Total Sessions
id: Total Sesi

# latestRecordDetailTitle
source: Latest Record Details:
id: Detail Pencatatan Terbaru:

# durationLabel
source: Duration
id: Durasi

# comparisonLabel
source: Comparison
id: Perbandingan

# complaintsLabel
source: Complaints
id: Keluhan

# activityPatternShortLabel
source: Pattern
id: Pola

# comparisonShortLabel
source: Comparison
id: Perbandingan

# timesValue
source: {n} times
id: {n} kali

# hoursValue
source: {n} hours
id: {n} jam

# perHourValue
source: {value}/hr
id: {value}/jam

# fetalMovementStandardTitle
source: Normal standard: at least 10 movements in 12 hours
id: Standar normal: minimal 10 gerakan dalam 12 jam

# fetalMovementStandardPerHour
source: ({value} movements per hour)
id: ({value} gerakan per jam)

# movementsCountText
source: {n} movements
id: {n} gerakan

# pointsValue
source: {n} points
id: {n} poin

# fetalMovementLabel
source: Fetal Movement
id: Gerakan Janin

# recordedLabel
source: Recorded
id: Tercatat

# factorsCount
source: {n} factors
id: {n} faktor

# riskNeedTreatment
source: Needs Treatment
id: Perlu Penanganan

# riskNeedAttention
source: Needs Attention
id: Perlu Perhatian

# riskSafe
source: Safe
id: Aman

# errorOccurredTitle
source: An error occurred
id: Terjadi Kesalahan

# fetalMovementStatusIncomplete
source: Incomplete Data
id: Data Belum Lengkap

# fetalMovementStatusNormal
source: Normal
id: Kondisi Normal

# fetalMovementStatusMonitor
source: Monitor
id: Perlu Pemantauan

# fetalMovementStatusAttention
source: Needs Attention
id: Perlu Perhatian

# fetalMovementStatusUrgent
source: Urgent
id: Perhatian Khusus

# fetalMovementMsgIncomplete
source: Fetal movement data is incomplete. Please complete the record.
id: Data gerakan janin belum lengkap. Silakan lengkapi pencatatan.

# fetalMovementMsgNormal
source: Fetal movement is within the normal range ({count} movements in 12 hours).
id: Gerakan janin dalam batas normal ({count} gerakan dalam 12 jam).

# fetalMovementMsgMonitor
source: {count} movements in 12 hours. Keep monitoring regularly and watch for changes.
id: Gerakan janin {count} kali dalam 12 jam. Tetap pantau secara rutin dan perhatikan perubahan gerakan.

# fetalMovementMsgAttention
source: {count} movements in 12 hours. It is recommended to consult a health professional.
id: Gerakan janin {count} kali dalam 12 jam. Disarankan konsultasi dengan tenaga kesehatan.

# fetalMovementMsgUrgent
source: Only {count} movements in 12 hours. Contact a health professional immediately.
id: Gerakan janin hanya {count} kali dalam 12 jam. Segera hubungi tenaga kesehatan.
